src/cf/AccumulationRegisters/СпецификацииДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>СпецификацииДоговоров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СпецификацияКДоговору</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номеклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/CommonModules/Доб_РаботаСДоговорамиИСпецификациями/Ext/Module.bsl
Процедура ДоговорОбработкаПроверкиЗаполненияОбработкаПроверкиЗаполнения(Источник, Отказ, ПроверяемыеРеквизиты) Экспорт
	
ПроверяемыеРеквизиты.Добавить ("СрокДействия");

КонецПроцедуры

Процедура ДокументыРеализацииПриПроведенииОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Движения = Источник.Движения;
	
	Движения.СпецификацииДоговоров.Записывать = Истина;
	
	Если ТипЗнч(Источник) = Тип ("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		
	Для Каждого ТекСтрокаТовары Из Источник.Товары Цикл
		
		Движение = Движения.СпецификацииДоговоров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Источник.Дата;
		Движение.Номеклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
		
	КонецЦикла;
	
	КонецЕсли;

	
КонецПроцедуры
